In [0]:
import pandas as pd
from sklearn.neighbors import KNeighborsClassifier
from sklearn.model_selection import GridSearchCV
from sklearn.model_selection import KFold
import time
import numpy as np

In [0]:
data_train = pd.read_csv('train.csv')

In [213]:
data_train

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [214]:
data_train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [0]:
#Substituindo os NaN da coluna 'idade' usando o algoritmo KNN.
from sklearn.impute import KNNImputer
fillna_knn = KNNImputer(n_neighbors = 2, weights="uniform",copy=False)
data_train['Age'] = fillna_knn.fit_transform(data_train[['Age']])
data_train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

In [0]:
data_train.groupby('Survived')['Sex'].value_counts()
data_train['Sex'].replace(['male','female'],[0,1], inplace = True)
data_train.head()

   PassengerId  Survived  Pclass  ...     Fare  Cabin  Embarked
0            1         0       3  ...   7.2500    NaN         0
1            2         1       1  ...  71.2833    C85         1
2            3         1       3  ...   7.9250    NaN         0
3            4         1       1  ...  53.1000   C123         0
4            5         0       3  ...   8.0500    NaN         0

[5 rows x 12 columns]

In [0]:
x = data_train[['Age','Pclass','Sex','SibSp','Parch']]
y = data_train['Survived']

In [228]:
SEED = 42
np.random.seed(SEED)
params = {
  'n_neighbors' : range(3,30),
  'weights': ['uniform','distance'],
  'algorithm' : ['ball_tree','kd_tree','brute'],
}
tic = time.time()
search =  GridSearchCV(KNeighborsClassifier(),
                   params,
                   cv = KFold(n_splits=10))

search.fit(x,y)
tac = time.time()
delta_t = tac - tic
print('time:%.2f seconds'% delta_t)
results = pd.DataFrame(search.cv_results_)
results_sorted = results.sort_values('mean_test_score', ascending= False)
results_sorted.head()

time:11.40 seconds

     mean_fit_time  std_fit_time  ...  std_test_score  rank_test_score
61        0.002258      0.000035  ...        0.029857                1
119       0.002861      0.000093  ...        0.026592                2
115       0.002985      0.000093  ...        0.037953                3
7         0.002250      0.000054  ...        0.030285                4
11        0.002194      0.000035  ...        0.032302                4

[5 rows x 21 columns]

In [0]:
model = search.best_estimator_

# Testando o modelo

In [0]:
data_test = pd.read_csv('test.csv')
data_test

     PassengerId  Pclass  ... Cabin Embarked
0            892       3  ...   NaN        Q
1            893       3  ...   NaN        S
2            894       2  ...   NaN        Q
3            895       3  ...   NaN        S
4            896       3  ...   NaN        S
..           ...     ...  ...   ...      ...
413         1305       3  ...   NaN        S
414         1306       1  ...  C105        C
415         1307       3  ...   NaN        S
416         1308       3  ...   NaN        S
417         1309       3  ...   NaN        C

[418 rows x 11 columns]

In [0]:
data_test.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [0]:
#susbtituindo os NaN da coluna idade
fillna_knn = KNNImputer(n_neighbors=2, weights="uniform",copy=False)
data_test['Age'] = fillna_knn.fit_transform(data_test[['Age']])
data_test.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [0]:
data_test

     PassengerId  Pclass  ... Cabin Embarked
0            892       3  ...   NaN        Q
1            893       3  ...   NaN        S
2            894       2  ...   NaN        Q
3            895       3  ...   NaN        S
4            896       3  ...   NaN        S
..           ...     ...  ...   ...      ...
413         1305       3  ...   NaN        S
414         1306       1  ...  C105        C
415         1307       3  ...   NaN        S
416         1308       3  ...   NaN        S
417         1309       3  ...   NaN        C

[418 rows x 11 columns]

In [0]:
data_test['Sex'].replace(['male','female'],[0,1], inplace = True)
data_test

     PassengerId  Pclass  ... Cabin  Embarked
0            892       3  ...   NaN         Q
1            893       3  ...   NaN         S
2            894       2  ...   NaN         Q
3            895       3  ...   NaN         S
4            896       3  ...   NaN         S
..           ...     ...  ...   ...       ...
413         1305       3  ...   NaN         S
414         1306       1  ...  C105         C
415         1307       3  ...   NaN         S
416         1308       3  ...   NaN         S
417         1309       3  ...   NaN         C

[418 rows x 11 columns]

In [0]:
x_test = data_test[['Age','Pclass','Sex','SibSp','Parch']]

In [0]:
y = model.predict(x_test)

In [0]:
# vendo como deve ser a submissÃ£o
example_of_submission = pd.read_csv('gender_submission.csv')
example_of_submission

     PassengerId  Survived
0            892         0
1            893         1
2            894         0
3            895         0
4            896         1
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

[418 rows x 2 columns]

In [0]:
# criando a tabela para a submissÃ£o
my_submission = pd.DataFrame(data_test['PassengerId'])
my_submission['Survived'] = y

In [0]:
my_submission.to_csv('my_submission.csv', index = False)

In [0]:
test1 = pd.read_csv('my_submission.csv')
# O score foi 0.7 segundo o algoritmo do keagle.